10/data/attachments/a557851f9b949eb2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_2f7c1038-5e21-4cc2-b8a3-8c59f27f5cdc</nif:username>
            <nif:friendToBeAdded>Brittney_create_Friend_19790_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>